Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаИсполнительногоПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоходовИсполнительногоПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>420</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНазначенияПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ведомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВедомостьВБанкЗарплатаКадры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедомостиПрочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ведомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВедомостьНаПеречислениеПрочихВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийПлатежногоПоручения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежногоПоручения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихДоходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПрочихВыплат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВедомостьНаПеречислениеПрочихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВедомостьНаПеречислениеПрочихВыплат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоПрочимВыплатам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрочихВыплат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПрочихВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСуммКПеречислению</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСуммКПеречислениюНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьГлавногоБухгалтера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиГлавногоБухгалтера</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрочиеВыплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПлатежноеПоручение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗУПК
	Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат Тогда
		МассивВедомостей = ВедомостиПрочие.Выгрузить(, "Ведомость").ВыгрузитьКолонку("Ведомость");
	Иначе
		МассивВедомостей = Ведомости.Выгрузить(, "Ведомость").ВыгрузитьКолонку("Ведомость");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты Тогда
		
		Запрос = Новый Запрос;
		Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
				|			КОГДА &СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|				ТОГДА ЛОЖЬ
				|			ИНАЧЕ ВЫБОР
				|					КОГДА &СтруктурноеПодразделение = ВедомостьНаПеречислениеПрочихВыплат.Подразделение
				|						ТОГДА ЛОЖЬ
				|					ИНАЧЕ ИСТИНА
				|				КОНЕЦ
				|		КОНЕЦ), ЛОЖЬ) КАК НеСоответствуетСтруктурное
				|ИЗ
				|	Документ.ВедомостьНаПеречислениеПрочихВыплат КАК ВедомостьНаПеречислениеПрочихВыплат
				|ГДЕ
				|	ВедомостьНаПеречислениеПрочихВыплат.Ссылка В(&МассивВедомостей)";
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты Тогда 
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
				|			КОГДА &СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|					ИЛИ ЕСТЬNULL(ПодразделенияОрганизаций.ОбособленноеПодразделение, ЛОЖЬ) = ЛОЖЬ
				|				ТОГДА ЛОЖЬ
				|			ИНАЧЕ ВЫБОР
				|					КОГДА &СтруктурноеПодразделение = ВедомостьНаВыплатуЗарплатыВБанк.Подразделение
				|						ТОГДА ЛОЖЬ
				|					ИНАЧЕ ИСТИНА
				|				КОНЕЦ
				|		КОНЕЦ), ЛОЖЬ) КАК НеСоответствуетСтруктурное
				|ИЗ
				|	Документ.ВедомостьНаВыплатуЗарплатыВБанк КАК ВедомостьНаВыплатуЗарплатыВБанк
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
				|		ПО ВедомостьНаВыплатуЗарплатыВБанк.Подразделение = ПодразделенияОрганизаций.Ссылка
				|ГДЕ
				|	ВедомостьНаВыплатуЗарплатыВБанк.Ссылка В(&МассивВедомостей)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
				|			КОГДА &СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
				|					ИЛИ ЕСТЬNULL(ПодразделенияОрганизаций.ОбособленноеПодразделение, ЛОЖЬ) = ЛОЖЬ
				|				ТОГДА ЛОЖЬ
				|			ИНАЧЕ ВЫБОР
				|					КОГДА &СтруктурноеПодразделение = ВедомостьНаВыплатуЗарплатыПеречислением.Подразделение
				|						ТОГДА ЛОЖЬ
				|					ИНАЧЕ ИСТИНА
				|				КОНЕЦ
				|		КОНЕЦ), ЛОЖЬ) КАК НеСоответствуетСтруктурное
				|ИЗ
				|	Документ.ВедомостьНаВыплатуЗарплатыПеречислением КАК ВедомостьНаВыплатуЗарплатыПеречислением
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
				|		ПО ВедомостьНаВыплатуЗарплатыПеречислением.Подразделение = ПодразделенияОрганизаций.Ссылка
				|ГДЕ
				|	ВедомостьНаВыплатуЗарплатыПеречислением.Ссылка В(&МассивВедомостей)";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("МассивВедомостей", МассивВедомостей);
		Запрос.УстановитьПараметр("СтруктурноеПодразделение", Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.НеСоответствуетСтруктурное Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не совпадает структурное подразделение ведомости и платежного документа'"));
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// ЗУПК
	
	ЗаполнитьФизическиеЛицаПоВедомостям();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Для Каждого ПараметрЗаполнения Из ДанныеЗаполнения Цикл
			Если ПараметрЗаполнения.Ключ = "Ведомости" Тогда
				Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
				Если ПараметрЗаполнения.Значение.Количество() = 1 И ОбменСБанкамиПоЗарплатнымПроектам.РазрешенаОтправкаОтдельнойВедомости() Тогда
					ТекстОшибки = НСтр("ru = 'Платежное поручение предназначено для группировки нескольких ведомостей с целью формирования единого реестра на зачисление зарплаты и отправки его в банк одним файлом.
										|Ввод платежного поручения никак не влияет на отражение факта выплаты зарплаты в программе. 
										|Создание платежного поручения имеет смысл только для более чем одной ведомости.'");
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				КонецЕсли;
				
				Для Каждого ЗначениеЗаполнения Из ПараметрЗаполнения.Значение Цикл
					// ЗУПК
					Если ТипЗнч(ЗначениеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаПеречислениеПрочихВыплат") Тогда
						ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначениеЗаполнения, , "Дата, Номер, Комментарий");
						ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат;
						БанковскийСчетКонтрагента = Справочники.Контрагенты.ОсновнойБанковскийСчет(Контрагент);
						БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация);
						НоваяСтрокаСостава = ВедомостиПрочие.Добавить();
						НоваяСтрокаСостава.Ведомость = ЗначениеЗаполнения;
					ИначеЕсли ТипЗнч(ЗначениеЗаполнения) = Тип("ДокументСсылка.ВедомостьПрочихДоходовВБанк")
						ИЛИ ТипЗнч(ЗначениеЗаполнения) = Тип("ДокументСсылка.ВедомостьПрочихДоходовПеречислением") Тогда
						ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначениеЗаполнения, , "Дата, Номер, Комментарий");
						ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихДоходов;
						БанковскийСчетКонтрагента = Справочники.Контрагенты.ОсновнойБанковскийСчет(Контрагент);
						БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация);
						НоваяСтрокаСостава = Ведомости.Добавить();
						НоваяСтрокаСостава.Ведомость = ЗначениеЗаполнения;
						Если ЗначениеЗаполнено(Организация) Тогда
							Если Организация <> ЗначениеЗаполнения.Организация Тогда
								ТекстОшибки = НСтр("ru = 'Платежное поручение предназначено для группировки нескольких ведомостей с целью формирования единого реестра по одной организации.'");
								ВызватьИсключение ТекстОшибки;
							КонецЕсли;
						Иначе
							Организация = ЗначениеЗаполнения.Организация;
						КонецЕсли;
						БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация);
					Иначе
						ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеЗарплаты;
						НоваяСтрокаСостава = Ведомости.Добавить();
						НоваяСтрокаСостава.Ведомость = ЗначениеЗаполнения;
						Если ЗначениеЗаполнено(Организация) Тогда
							Если Организация <> ЗначениеЗаполнения.Организация Тогда
								ТекстОшибки = НСтр("ru = 'Платежное поручение предназначено для группировки нескольких ведомостей с целью формирования единого реестра по одной организации.'");
								ВызватьИсключение ТекстОшибки;
							КонецЕсли;
						Иначе
							Организация = ЗначениеЗаполнения.Организация;
						КонецЕсли;
						БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(Организация);
					КонецЕсли;
					Если ЗначениеЗаполнено(Подразделение) Тогда
						Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "ОбособленноеПодразделение") Тогда
							Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
						Иначе
							ФактическийПлательщик = Подразделение;	
						КонецЕсли;
                    КонецЕсли;
					// ЗУПК
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	// ЗУПК
	Иначе
	
	// ЗУПК
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	// в старых документах вид дохода не обязателен
	Если Не Документы.ПлатежноеПоручение.ВидДоходаИсполнительногоПроизводстваОбязателен(ЭтотОбъект) Тогда
		НепроверяемыеРеквизиты.Добавить("ВидДоходаИсполнительногоПроизводства");
	КонецЕсли;
	
	// ЗУПК
	Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат Тогда
		НепроверяемыеРеквизиты.Добавить("Ведомости");	
	Иначе
		НепроверяемыеРеквизиты.Добавить("ВедомостиПрочие");	
	КонецЕсли;
	// ЗУПК
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	МассивВедомостей = Новый Массив;
	НомераСтрокВедомостей = Новый Соответствие;
	// ЗУПК
	Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат Тогда
		Для каждого СтрокаДокумента Из ВедомостиПрочие Цикл
			НомераСтрокВедомостей.Вставить(СтрокаДокумента.Ведомость, СтрокаДокумента.НомерСтроки);
			МассивВедомостей.Добавить(СтрокаДокумента.Ведомость);
		КонецЦикла;
	Иначе
	// ЗУПК
	Для каждого СтрокаДокумента Из Ведомости Цикл
		НомераСтрокВедомостей.Вставить(СтрокаДокумента.Ведомость, СтрокаДокумента.НомерСтроки);
		МассивВедомостей.Добавить(СтрокаДокумента.Ведомость);
	КонецЦикла;
	// ЗУПК
	КонецЕсли;
	// ЗУПК
	
	МассивОшибок = Новый Массив;
	ОбменСБанкамиПоЗарплатнымПроектам.ПроверитьЗаполнениеПлатежногоДокумента(Ссылка, МассивВедомостей, МассивОшибок);
	
	// ЗУПК
	Если ВидОперации = Перечисления.ВидыОперацийПлатежногоПоручения.ПеречислениеПрочихВыплат Тогда
		ПроверитьЗаполнениеПрочихВыплат(МассивОшибок);
		ПроверитьВидВедомости(МассивОшибок);
		ИмяТЧ = "ВедомостиПрочие";
	Иначе
		ИмяТЧ = "Ведомости";
	КонецЕсли;
	// ЗУПК
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		ОбщегоНазначения.СообщитьПользователю(
			Ошибка.ТекстСообщения, 
			ЭтотОбъект,  
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				// ЗУПК
				ИмяТЧ, 
				?(ЗначениеЗаполнено(Ошибка.Ведомость), НомераСтрокВедомостей[Ошибка.Ведомость], 1), 
				// ЗУПК
				"Ведомость"),, 
			Отказ);
	КонецЦикла;
	
	Если Не Отказ Тогда
		ДополнительныеСвойства.Вставить("ПроверкаВыполнена", Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	НомерРеестра = 0;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак изменения данных, влияющих на формирование электронного документа.
// 
Функция ИзменилисьКлючевыеРеквизитыЭлектронногоДокумента() Экспорт
	
	ИзменилисьКлючевыеРеквизиты = 
		ЭлектронноеВзаимодействиеБЗК.ИзменилисьРеквизитыОбъекта(ЭтотОбъект, "Дата, Номер, Организация, НомерРеестра, ПометкаУдаления")	
		Или ЭлектронноеВзаимодействиеБЗК.ИзмениласьТабличнаяЧастьОбъекта(ЭтотОбъект, "Ведомости", "Ведомость");
		
	Возврат ИзменилисьКлючевыеРеквизиты;
	
КонецФункции

// Добавляет в документ указанные ведомости.
// Параметры:
// 		ДобавляемыеВедомости - Массив из ДокументСсылка - добавляемые ведомости
// 
Процедура ДобавитьВедомости(ДобавляемыеВедомости) Экспорт
	
	Для Каждого Ведомость Из ДобавляемыеВедомости Цикл
		Если Ведомости.Найти(Ведомость, "Ведомость") = Неопределено Тогда
			НоваяСтрока = Ведомости.Добавить();
			НоваяСтрока.Ведомость = Ведомость;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьФизическиеЛицаПоВедомостям()
	
	ФизическиеЛица.Очистить();
	
	Если Ведомости.Количество() > 0 Тогда
		
		ФизлицаВедомостей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			Ведомости.ВыгрузитьКолонку("Ведомость"), 
			"ФизическиеЛица");
			
		ФизическиеЛицаВедомостей = Новый Массив;
		Для Каждого ФизлицаВедомости Из ФизлицаВедомостей Цикл
			Если Не ФизлицаВедомости.Значение.Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
					ФизическиеЛицаВедомостей,
					ФизлицаВедомости.Значение.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"));
			КонецЕсли;
		КонецЦикла;	
		
		Для Каждого ФизическоеЛицо Из ОбщегоНазначенияКлиентСервер.СвернутьМассив(ФизическиеЛицаВедомостей) Цикл
			ФизическиеЛица.Добавить().ФизическоеЛицо = ФизическоеЛицо
		КонецЦикла	
		
	КонецЕсли;
	
    // ЗУПК
	Если ВедомостиПрочие.Количество() > 0 Тогда
		
		ФизлицаВедомостей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ВедомостиПрочие.ВыгрузитьКолонку("Ведомость"), 
			"ПрочиеВыплаты");
			
		ФизическиеЛицаВедомостей = Новый Массив;
		Для Каждого ФизлицаВедомости Из ФизлицаВедомостей Цикл
			Если Не ФизлицаВедомости.Значение.Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
					ФизическиеЛицаВедомостей,
					ФизлицаВедомости.Значение.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"));
			КонецЕсли;
		КонецЦикла;	
		
		Для Каждого ФизическоеЛицо Из ОбщегоНазначенияКлиентСервер.СвернутьМассив(ФизическиеЛицаВедомостей) Цикл
			ФизическиеЛица.Добавить().ФизическоеЛицо = ФизическоеЛицо
		КонецЦикла	
		
	КонецЕсли;
    // ЗУПК
	
КонецПроцедуры

// ЗУПК
Процедура ПроверитьЗаполнениеПрочихВыплат(МассивОшибок)
	
	// Проверка на одинаковый вид прочих выплат в ведомости
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПеречислениеПрочихВыплат", ВедомостиПрочие.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ *
				   |ПОМЕСТИТЬ ВТ_ПеречислениеПрочихВыплат
				   |ИЗ &ПеречислениеПрочихВыплат КАК ПеречислениеПрочихВыплат
				   |
				   |;
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ПеречислениеПрочихВыплат.Ведомость.ВидПрочихВыплат КАК ВидПрочихВыплат
	               |ИЗ
	               |	ВТ_ПеречислениеПрочихВыплат КАК ПеречислениеПрочихВыплат";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Количество() > 1 Тогда

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'В табличной части ""Списки на перечисление прочих выплат"" указаны ведомости с различными видами прочих выплат:
				|нельзя выполнять платеж одним документом по разным видам прочих выплат'"));
		МассивОшибок.Добавить(Новый Структура("ТекстСообщения, Ведомость", ТекстОшибки));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВидВедомости(МассивОшибок)
	
	// Проверка на одинаковый вид прочих выплат в ведомости
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТабличнаяЧастьДокумента", ВедомостиПрочие.Выгрузить());
	
	Запрос.Текст = "ВЫБРАТЬ *
				   |ПОМЕСТИТЬ ВТ_ТабличнаяЧастьДокумента
				   |ИЗ &ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента
				   |
				   |;
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ТИПЗНАЧЕНИЯ(ТабличнаяЧастьДокумента.Ведомость) КАК ТипыВедомостей
	               |ИЗ
	               |	ВТ_ТабличнаяЧастьДокумента КАК ТабличнаяЧастьДокумента";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Количество() > 1 Тогда

		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'В табличной части платежного поручения должны быть выбраны ведомости одного вида'"));
		МассивОшибок.Добавить(Новый Структура("ТекстСообщения, Ведомость", ТекстОшибки));
		
	КонецЕсли;
	
КонецПроцедуры
// ЗУПК

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
